//--------------------------------------------------------------------------------
// 
// Filename    : CURequestLoginMode.cpp 
// Written By  : Reiot
// 
//--------------------------------------------------------------------------------

// include files
#include "Client_PCH.h"
#include "CURequestLoginMode.h"


//--------------------------------------------------------------------------------
// 입력스트림(버퍼)으로부터 데이타를 읽어서 패킷을 초기화한다.
//--------------------------------------------------------------------------------
void CURequestLoginMode::read ( SocketInputStream & iStream )
{
	__BEGIN_TRY
	(void)iStream;
	__END_CATCH
}


//--------------------------------------------------------------------------------
// 소켓으로부터 직접 데이타를 읽어서 패킷을 초기화한다.
//--------------------------------------------------------------------------------
void CURequestLoginMode::read ( Socket * pSocket )
{
	__BEGIN_TRY
	(void)pSocket;
	__END_CATCH
}

	    
//--------------------------------------------------------------------------------
// 출력스트림(버퍼)으로 패킷의 바이너리 이미지를 보낸다.
//--------------------------------------------------------------------------------
void CURequestLoginMode::write ( SocketOutputStream & oStream ) const
{
	__BEGIN_TRY
	(void)oStream;
	__END_CATCH
}

//--------------------------------------------------------------------------------
// get debug string
//--------------------------------------------------------------------------------
string CURequestLoginMode::toString () const
{

	return "CUReqeustLoginMode()";
}
